Merge pull request #1 from devashishgorai/devashishgorai-patch-1
Revise README for clarity and additional features
